/* In browser window title */
"Get a registration key!" = "Non registrato";

/* The full name of the supporter */
"Registered to {0}" = "Registrato a {0}";

/* Cyberduck is open source software */
"Thanks for your support! Your contribution helps to further advance development to make Cyberduck even better." = "Grazie per il supporto! Il tuo contributo aiuterà l'ulteriore sviluppo e renderà Cyberduck ancora migliore.";

/* Copy of donation key */
"Your registration key has been copied to the Application Support folder." = "La chiave di registrazione è stata copiata nella cartella Application Support.";

/* Validation failed */
"Not a valid registration key" = "Chiave registrazione non valida";

"This registration key does not appear to be valid." = "Questa chiave di registrazione non sembra valida.";

/* Thank you */
"Continue" = "Continua";
